mtest> mtn 10

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 1
* Free mem in last block: 64976
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---
oooooooooo
Array list ---


mtest> mtn 5 -a 256

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 2
* Free mem in last block: 52216
* Recycle list          : 
[224] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
oooooooooo
Array list ---
ooooo

mtest> mtn 5 -a 512

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 4
* Free mem in last block: 12272
* Recycle list          : 
[224] = 1         [235] = 1         [491] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
oooooooooo
Array list ---
oooooooooo

mtest> mtd -i 7 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 4
* Free mem in last block: 12272
* Recycle list          : 
[512] = 1         [224] = 1         [235] = 1         [491] = 1         

=========================================
=             class MemTest             =
=========================================
Object list ---
oooooooooo
Array list ---
oooooooxoo

mtest> mtd -i 0 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 4
* Free mem in last block: 12272
* Recycle list          : 
[256] = 1         [512] = 1         [224] = 1         [235] = 1         
[491] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
oooooooooo
Array list ---
xooooooxoo

mtest> q -f

