mtest> mtreset 250

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 256 Bytes
* Number of blocks      : 1
* Free mem in last block: 256
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---

Array list ---


mtest> mtnew 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 256 Bytes
* Number of blocks      : 1
* Free mem in last block: 88
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---
ooo
Array list ---


mtest> mtdel -r 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 256 Bytes
* Number of blocks      : 1
* Free mem in last block: 88
* Recycle list          : 
[  0] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---


mtest> mtnew 5 -a 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 256 Bytes
* Number of blocks      : 6
* Free mem in last block: 88
* Recycle list          : 
[  0] = 2         [  1] = 5         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
ooooo

mtest> mtdel -r 2 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 256 Bytes
* Number of blocks      : 6
* Free mem in last block: 88
* Recycle list          : 
[  0] = 2         [  1] = 5         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxooo

mtest> mtnew -a 1 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 256 Bytes
* Number of blocks      : 6
* Free mem in last block: 88
* Recycle list          : 
[  0] = 2         [  1] = 2         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxoooooo

mtest> mtnew -a 5 3
Requested memory (272) is greater than block size(256). Exception raised...

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 256 Bytes
* Number of blocks      : 6
* Free mem in last block: 88
* Recycle list          : 
[  0] = 2         [  1] = 2         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxoooooo

mtest> mtnew -a 7 2
Requested memory (376) is greater than block size(256). Exception raised...

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 256 Bytes
* Number of blocks      : 6
* Free mem in last block: 88
* Recycle list          : 
[  0] = 2         [  1] = 2         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxoooooo

mtest> mtdel -r 8 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 256 Bytes
* Number of blocks      : 6
* Free mem in last block: 88
* Recycle list          : 
[  0] = 2         [  1] = 4         [  3] = 5         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxxxxxox

mtest> mtdel -i 12 -a
Size of array list (8) is <= 12!!
Error: Illegal option!! (12)

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 256 Bytes
* Number of blocks      : 6
* Free mem in last block: 88
* Recycle list          : 
[  0] = 2         [  1] = 4         [  3] = 5         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxxxxxox

mtest> q -f

