task> taski 100
Task manager is initialized (100)

task> taskn -n apl 12
Task node inserted: (apl, 12)

task> taskn -n ldk 523
Task node inserted: (ldk, 523)

task> taskn -n fdrw 23
Task node inserted: (fdrw, 23)

task> taskn -n ede 987
Task node inserted: (ede, 987)

task> taskr -n ldk 
Task node removed: (ldk, 523)

task> taskr -n fdrw  
Task node removed: (fdrw, 23)

task> taskr -n apl 
Task node removed: (apl, 12)

task> taskr -n ede 
Task node removed: (ede, 987)

task> taskq -hash
(ede, 987)
(apl, 12)
(fdrw, 23)
(ldk, 523)
Number of tasks: 0

task> quit -f

